In [10]:
print('Inteligencia Artificial e Big Data - aula 02')

Inteligencia Artificial e Big Data - aula 02

In [9]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\documents\danilo macri\iabd\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [12]:
Dicionario = {
    'A': [1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}

# Criando um index para linhas do dicionario
Label = ['1ª Linha','2ª Linha','3ª Linha']

# Criar o Dataframe
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [13]:
Dataframe_01[['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [14]:
Dataframe_01['Nova coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [15]:
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [16]:
a =5
print(a)
Dataframe_01

5

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [17]:
Dataframe_01.drop('Nova coluna',axis=1)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [18]:
Dataframe_01.drop('1ª Linha',axis=0)

          A  B   C  Nova coluna
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [19]:
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [20]:
Dataframe_01.drop('Nova coluna',axis=1,inplace=True)

In [21]:
Dataframe_01.loc['1ª Linha']

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [22]:
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [23]:
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [24]:
Dataframe_01.loc[['1ª Linha','2ª Linha'],['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2

In [25]:
Dataframe_01.head()

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [26]:
Dataframe_01.tail()

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [27]:
Dataframe_01.iloc[2:3,1:]

          B   C
3ª Linha -1  20

In [28]:
Dataframe_01.iloc[2:3]

          A  B   C
3ª Linha  3 -1  20

In [29]:
Dataframe_01.iloc[:,2]

1ª Linha     0
2ª Linha    10
3ª Linha    20
Name: C, dtype: int64

In [30]:
Filtro = Dataframe_01['C'] > 0
Dataframe_02 = Dataframe_01[Filtro]

In [31]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [32]:
Dataframe_01 > 0

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [33]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [34]:
Dataframe_01[(Dataframe_01['A'] > 1) & (Dataframe_01['C'] > 0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [35]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [36]:
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [37]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [38]:
Dataframe_01.reset_index(inplace= True)

In [39]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [40]:
Dataframe_01.drop('index',axis=1,inplace= True)

In [41]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [42]:
Dicionario_01a = {
    'A': [1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20],
    'Chave':['AA','BB','CC']
}

# Dicionario 2 
Dicionario_02 = {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000,10,60],
    'Chave':['AA','BB','CC']
}

# Dicionario 3
Dicionario_03 ={
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']
}
# Labels em forma de lista
Label_01 = ['1ª Linha','2ª Linha','3ª Linha']
Label_02 = ['4ª Linha','5ª Linha','6ª Linha']
Label_03 =['7ª Linha','8ª Linha','9ª Linha']

# Criação dos dataframes
Dataframe_01n = pd.DataFrame(Dicionario_01a,index=Label_01)
Dataframe_02n = pd.DataFrame(Dicionario_02,index=Label_02)
Dataframe_03 = pd.DataFrame(Dicionario_03,index=Label_03)

In [43]:
Dataframe_01n

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [44]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [45]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [47]:
# Junção de dataframes em um só
pd.concat([Dataframe_01n,Dataframe_02n,Dataframe_03])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [48]:
pd.merge(Dataframe_01n,Dataframe_02n,how='inner',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [49]:
pd.merge(Dataframe_01n,Dataframe_03,how='left',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [50]:
print(Dataframe_01n)
print(Dataframe_03)

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC
           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [51]:
pd.merge(Dataframe_01n,Dataframe_03,how='right',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [52]:
pd.merge(Dataframe_01n,Dataframe_02n,how='outer',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [53]:
dic1 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20]
}

dic2 = {
    'D':[6,7,8],
    'E':[-39,-28,-27],
    'F':[1000,10,60]
}

# Criação dos labels

Label_01a = ['1ª Linha','2ª Linha','3ª Linha']

# Estruturando o Dataframe
df01 = pd.DataFrame(dic1,index= Label_01a)
df02 = pd.DataFrame(dic2,index= Label_01a)

In [54]:
df01

          A   B   C
1ª Linha  1 -32  60
2ª Linha  2 -21  10
3ª Linha  3 -15  20

In [55]:
df02

          D   E     F
1ª Linha  6 -39  1000
2ª Linha  7 -28    10
3ª Linha  8 -27    60

In [56]:
df01.join(df02)

          A   B   C  D   E     F
1ª Linha  1 -32  60  6 -39  1000
2ª Linha  2 -21  10  7 -28    10
3ª Linha  3 -15  20  8 -27    60

In [60]:
# Exercício 1)
DicionarioPessoas = {
    'Nome': ["Alice", "Julia", "Bruna", 
             "Daniel", "Filipe", "Silvio"],
    'Idade':[19, 22, 28,
             34, 28, 48],
    'Profissão':["Direito", "Engenharia", "Enfermagem",
                 "Engenheiro Civil", "Cientista da Computação", "Engenheiro Eletrônico"],
    'ID': [1,2,3,
           4,5,6]
}

# Criando um index para linhas do dicionario
Label = ['1ª Pessoa','2ª Pessoa','3ª Pessoa', 
         '4ª Pessoa', '5ª Pessoa', '6ª Pessoa']

# Criar o Dataframe
Dataframe_Pessoas = pd.DataFrame(DicionarioPessoas,index=Label)
print(Dataframe_Pessoas)

             Nome  Idade                Profissão  ID
1ª Pessoa   Alice     19                  Direito   1
2ª Pessoa   Julia     22               Engenharia   2
3ª Pessoa   Bruna     28               Enfermagem   3
4ª Pessoa  Daniel     34         Engenheiro Civil   4
5ª Pessoa  Filipe     28  Cientista da Computação   5
6ª Pessoa  Silvio     48    Engenheiro Eletrônico   6

In [61]:
# Exercício 2)
DicionarioProdutos = {
    'Produto Fabricados': [50, 30, 40, 100],
    'ID': [1,2,3,4]
}

# Criando um index para linhas do dicionario
Label = ['1ª Produto','2ª Produto','3ª Produto','4ª Produto']

# Criar o Dataframe
Dataframe_Produto = pd.DataFrame(DicionarioProdutos,index=Label)
print(Dataframe_Produto)

            Produto Fabricados  ID
1ª Produto                  50   1
2ª Produto                  30   2
3ª Produto                  40   3
4ª Produto                 100   4

In [65]:
dicionarioInfoPessoal = {
    'ID': [1,2,3,4],
    'Nome': ["Ana", "Pedro", "Maria", "João"],
    'Setores': ["Rh", "Vendas", "Administrativo", "Produção"]
}

dicionarioSalario = {
    'ID': [1,2,3,4],
    'Salario': [3000, 2800, 3200, 2500]
}

labels = ["1ª Linha", "2ª Linha", "3ª Linha", "4ª Linha"]

dataframeInfoPessoal = pd.DataFrame(dicionarioInfoPessoal,index=labels)
dataframeSalario = pd.DataFrame(dicionarioSalario,index=labels)
pd.merge(dataframeInfoPessoal, dataframeSalario, how='inner', on="ID")

   ID   Nome         Setores  Salario
0   1    Ana              Rh     3000
1   2  Pedro          Vendas     2800
2   3  Maria  Administrativo     3200
3   4   João        Produção     2500

In [ ]:
dicionarioVendas1 = {
    'Data': ["2023-01-01", "2023-01-02", "2023-01-03"],
    'Produto': ["Item A", "Item B", "Item A"],
    'Quantidade': [10, 5, 8],
    'Valor': [100.00, 50.00, 80.00]
}

dicionarioVendas2 = {
    'Data': ["2023-02-01", "2023-02-02", "2023-02-03"],
    'Produto': ["Item C", "Item B", "Item D"],
    'Quantidade': [12, 6, 3],
    'Valor': [120.00, 60.00, 30.00]
}

labels = ["1ª Linha", "2ª Linha", "3ª Linha"]
dataframeVendas1 = pd.DataFrame(dicionarioVendas1, index=labels)
dataframeVendas2 = pd.DataFrame(dicionarioVendas2, index=labels)
print(dataframeVendas1)
print(dataframeVendas2)

                Data Produto  Quantidade  Valor
1ª Linha  2023-01-01  Item A          10  100.0
2ª Linha  2023-01-02  Item B           5   50.0
3ª Linha  2023-01-03  Item A           8   80.0
                Data Produto  Quantidade  Valor
1ª Linha  2023-02-01  Item C          12  120.0
2ª Linha  2023-02-02  Item B           6   60.0
3ª Linha  2023-02-03  Item D           3   30.0